MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECH100/mcu.h
extern volatile __CFGEBIAbits_t CFGEBIAbits __asm__ ("CFGEBIA") __attribute__((section("sfrs"), address(0xBF8000C0)));
extern volatile uint32_t        CFGEBIACLR __attribute__((section("sfrs"),address(0xBF8000C4)));
extern volatile uint32_t        CFGEBIASET __attribute__((section("sfrs"),address(0xBF8000C8)));
extern volatile uint32_t        CFGEBIAINV __attribute__((section("sfrs"),address(0xBF8000CC)));
#define CFGEBIC CFGEBIC
extern volatile uint32_t   CFGEBIC __attribute__((section("sfrs"), address(0xBF8000D0)));
typedef struct {
  uint32_t EBIDEN0:1;
  uint32_t EBIDEN1:1;
  uint32_t :2;
  uint32_t EBICSEN0:1;
  uint32_t :7;
  uint32_t EBIOEEN:1;
  uint32_t EBIWEEN:1;
  uint32_t :3;
  uint32_t EBIRDYLVL:1;
  uint32_t :6;
  uint32_t EBIRDYEN1:1;
  uint32_t EBIRDYEN2:1;
  uint32_t EBIRDYEN3:1;
  uint32_t :1;
  uint32_t EBIRDYINV1:1;
  uint32_t EBIRDYINV2:1;
  uint32_t EBIRDYINV3:1;
} __CFGEBICbits_t;
extern volatile __CFGEBICbits_t CFGEBICbits __asm__ ("CFGEBIC") __attribute__((section("sfrs"), address(0xBF8000D0)));
extern volatile uint32_t        CFGEBICCLR __attribute__((section("sfrs"),address(0xBF8000D4)));
extern volatile uint32_t        CFGEBICSET __attribute__((section("sfrs"),address(0xBF8000D8)));
extern volatile uint32_t        CFGEBICINV __attribute__((section("sfrs"),address(0xBF8000DC)));
#define CFGPG CFGPG
extern volatile uint32_t   CFGPG __attribute__((section("sfrs"), address(0xBF8000E0)));
typedef struct {
  uint32_t CPUPG:2;
  uint32_t :2;
  uint32_t DMAPG:2;
  uint32_t :2;
  uint32_t USBPG:2;
  uint32_t :2;
  uint32_t CAN1PG:2;
  uint32_t CAN2PG:2;
  uint32_t ETHPG:2;
  uint32_t :2;
  uint32_t SQI1PG:2;
  uint32_t FCPG:2;
} __CFGPGbits_t;
extern volatile __CFGPGbits_t CFGPGbits __asm__ ("CFGPG") __attribute__((section("sfrs"), address(0xBF8000E0)));
extern volatile uint32_t        CFGPGCLR __attribute__((section("sfrs"),address(0xBF8000E4)));
extern volatile uint32_t        CFGPGSET __attribute__((section("sfrs"),address(0xBF8000E8)));
extern volatile uint32_t        CFGPGINV __attribute__((section("sfrs"),address(0xBF8000EC)));
#define NVMCON NVMCON
extern volatile uint32_t   NVMCON __attribute__((section("sfrs"), address(0xBF800600)));
typedef union {
  struct {
    uint32_t NVMOP:4;
    uint32_t :3;
    uint32_t SWAP:1;
    uint32_t :4;
    uint32_t LVDERR:1;
    uint32_t WRERR:1;
    uint32_t WREN:1;
    uint32_t WR:1;
  };
  struct {
    uint32_t NVMOP0:1;
    uint32_t NVMOP1:1;
    uint32_t NVMOP2:1;
    uint32_t NVMOP3:1;
  };
  struct {
    uint32_t PROGOP:4;
  };
  struct {
    uint32_t PROGOP0:1;
    uint32_t PROGOP1:1;
    uint32_t PROGOP2:1;
    uint32_t PROGOP3:1;
  };
  struct {
    uint32_t w:32;
  };
} __NVMCONbits_t;
extern volatile __NVMCONbits_t NVMCONbits __asm__ ("NVMCON") __attribute__((section("sfrs"), address(0xBF800600)));
extern volatile uint32_t        NVMCONCLR __attribute__((section("sfrs"),address(0xBF800604)));
extern volatile uint32_t        NVMCONSET __attribute__((section("sfrs"),address(0xBF800608)));
extern volatile uint32_t        NVMCONINV __attribute__((section("sfrs"),address(0xBF80060C)));
#define NVMKEY NVMKEY
extern volatile uint32_t   NVMKEY __attribute__((section("sfrs"), address(0xBF800610)));
#define NVMADDR NVMADDR
extern volatile uint32_t   NVMADDR __attribute__((section("sfrs"), address(0xBF800620)));
extern volatile uint32_t        NVMADDRCLR __attribute__((section("sfrs"),address(0xBF800624)));
extern volatile uint32_t        NVMADDRSET __attribute__((section("sfrs"),address(0xBF800628)));
extern volatile uint32_t        NVMADDRINV __attribute__((section("sfrs"),address(0xBF80062C)));
#define NVMDATA0 NVMDATA0
extern volatile uint32_t   NVMDATA0 __attribute__((section("sfrs"), address(0xBF800630)));
#define NVMDATA1 NVMDATA1
extern volatile uint32_t   NVMDATA1 __attribute__((section("sfrs"), address(0xBF800640)));
#define NVMDATA2 NVMDATA2
extern volatile uint32_t   NVMDATA2 __attribute__((section("sfrs"), address(0xBF800650)));
#define NVMDATA3 NVMDATA3
extern volatile uint32_t   NVMDATA3 __attribute__((section("sfrs"), address(0xBF800660)));
#define NVMSRCADDR NVMSRCADDR
extern volatile uint32_t   NVMSRCADDR __attribute__((section("sfrs"), address(0xBF800670)));
#define NVMPWP NVMPWP
extern volatile uint32_t   NVMPWP __attribute__((section("sfrs"), address(0xBF800680)));
typedef struct {
  uint32_t PWP:24;
  uint32_t :7;
  uint32_t PWPULOCK:1;
} __NVMPWPbits_t;
extern volatile __NVMPWPbits_t NVMPWPbits __asm__ ("NVMPWP") __attribute__((section("sfrs"), address(0xBF800680)));
#define NVMBWP NVMBWP
extern volatile uint32_t   NVMBWP __attribute__((section("sfrs"), address(0xBF800690)));
typedef struct {
  uint32_t UBWP0:1;
  uint32_t UBWP1:1;
  uint32_t UBWP2:1;
  uint32_t UBWP3:1;
  uint32_t UBWP4:1;
  uint32_t :2;
  uint32_t UBWPULOCK:1;
  uint32_t LBWP0:1;
  uint32_t LBWP1:1;
  uint32_t LBWP2:1;
  uint32_t LBWP3:1;
  uint32_t LBWP4:1;
  uint32_t :2;
  uint32_t LBWPULOCK:1;
} __NVMBWPbits_t;
extern volatile __NVMBWPbits_t NVMBWPbits __asm__ ("NVMBWP") __attribute__((section("sfrs"), address(0xBF800690)));
extern volatile uint32_t        NVMBWPCLR __attribute__((section("sfrs"),address(0xBF800694)));
extern volatile uint32_t        NVMBWPSET __attribute__((section("sfrs"),address(0xBF800698)));
extern volatile uint32_t        NVMBWPINV __attribute__((section("sfrs"),address(0xBF80069C)));
#define WDTCON WDTCON
extern volatile uint32_t   WDTCON __attribute__((section("sfrs"), address(0xBF800800)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t WDTWINEN:1;
    uint32_t SWDTPS:5;
    uint32_t :8;
    uint32_t ON:1;
    uint32_t WDTCLRKEY:16;
  };
  struct {
    uint32_t :2;
    uint32_t SWDTPS0:1;
    uint32_t SWDTPS1:1;
    uint32_t SWDTPS2:1;
    uint32_t SWDTPS3:1;
    uint32_t SWDTPS4:1;
    uint32_t :9;
    uint32_t WDTCLRKEY0:1;
    uint32_t WDTCLRKEY1:1;
    uint32_t WDTCLRKEY2:1;
    uint32_t WDTCLRKEY3:1;
    uint32_t WDTCLRKEY4:1;
    uint32_t WDTCLRKEY5:1;
    uint32_t WDTCLRKEY6:1;
    uint32_t WDTCLRKEY7:1;
    uint32_t WDTCLRKEY8:1;
    uint32_t WDTCLRKEY9:1;
    uint32_t WDTCLRKEY10:1;
    uint32_t WDTCLRKEY11:1;
    uint32_t WDTCLRKEY12:1;
    uint32_t WDTCLRKEY13:1;
    uint32_t WDTCLRKEY14:1;
    uint32_t WDTCLRKEY15:1;
  };
  struct {
    uint32_t :2;
    uint32_t WDTPSTA:5;
  };
  struct {
    uint32_t :2;
    uint32_t WDTPS:5;
  };
  struct {
    uint32_t w:32;
  };
} __WDTCONbits_t;
extern volatile __WDTCONbits_t WDTCONbits __asm__ ("WDTCON") __attribute__((section("sfrs"), address(0xBF800800)));
extern volatile uint32_t        WDTCONCLR __attribute__((section("sfrs"),address(0xBF800804)));
extern volatile uint32_t        WDTCONSET __attribute__((section("sfrs"),address(0xBF800808)));
extern volatile uint32_t        WDTCONINV __attribute__((section("sfrs"),address(0xBF80080C)));
#define DMTCON DMTCON
extern volatile uint32_t   DMTCON __attribute__((section("sfrs"), address(0xBF800A00)));
typedef struct {
  uint32_t :15;
  uint32_t ON:1;
} __DMTCONbits_t;
extern volatile __DMTCONbits_t DMTCONbits __asm__ ("DMTCON") __attribute__((section("sfrs"), address(0xBF800A00)));
#define DMTPRECLR DMTPRECLR
extern volatile uint32_t   DMTPRECLR __attribute__((section("sfrs"), address(0xBF800A10)));
typedef struct {
  uint32_t :8;
  uint32_t STEP1:8;
} __DMTPRECLRbits_t;
