MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECH100/mcu.h
extern volatile __AD1DATA19bits_t AD1DATA19bits __asm__ ("AD1DATA19") __attribute__((section("sfrs"), address(0xBF84B104)));
#define AD1DATA20 AD1DATA20
extern volatile uint32_t   AD1DATA20 __attribute__((section("sfrs"), address(0xBF84B108)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA20bits_t;
extern volatile __AD1DATA20bits_t AD1DATA20bits __asm__ ("AD1DATA20") __attribute__((section("sfrs"), address(0xBF84B108)));
#define AD1DATA21 AD1DATA21
extern volatile uint32_t   AD1DATA21 __attribute__((section("sfrs"), address(0xBF84B10C)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA21bits_t;
extern volatile __AD1DATA21bits_t AD1DATA21bits __asm__ ("AD1DATA21") __attribute__((section("sfrs"), address(0xBF84B10C)));
#define AD1DATA22 AD1DATA22
extern volatile uint32_t   AD1DATA22 __attribute__((section("sfrs"), address(0xBF84B110)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA22bits_t;
extern volatile __AD1DATA22bits_t AD1DATA22bits __asm__ ("AD1DATA22") __attribute__((section("sfrs"), address(0xBF84B110)));
#define AD1DATA23 AD1DATA23
extern volatile uint32_t   AD1DATA23 __attribute__((section("sfrs"), address(0xBF84B114)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA23bits_t;
extern volatile __AD1DATA23bits_t AD1DATA23bits __asm__ ("AD1DATA23") __attribute__((section("sfrs"), address(0xBF84B114)));
#define AD1DATA24 AD1DATA24
extern volatile uint32_t   AD1DATA24 __attribute__((section("sfrs"), address(0xBF84B118)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA24bits_t;
extern volatile __AD1DATA24bits_t AD1DATA24bits __asm__ ("AD1DATA24") __attribute__((section("sfrs"), address(0xBF84B118)));
#define AD1DATA25 AD1DATA25
extern volatile uint32_t   AD1DATA25 __attribute__((section("sfrs"), address(0xBF84B11C)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA25bits_t;
extern volatile __AD1DATA25bits_t AD1DATA25bits __asm__ ("AD1DATA25") __attribute__((section("sfrs"), address(0xBF84B11C)));
#define AD1DATA26 AD1DATA26
extern volatile uint32_t   AD1DATA26 __attribute__((section("sfrs"), address(0xBF84B120)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA26bits_t;
extern volatile __AD1DATA26bits_t AD1DATA26bits __asm__ ("AD1DATA26") __attribute__((section("sfrs"), address(0xBF84B120)));
#define AD1DATA27 AD1DATA27
extern volatile uint32_t   AD1DATA27 __attribute__((section("sfrs"), address(0xBF84B124)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA27bits_t;
extern volatile __AD1DATA27bits_t AD1DATA27bits __asm__ ("AD1DATA27") __attribute__((section("sfrs"), address(0xBF84B124)));
#define AD1DATA28 AD1DATA28
extern volatile uint32_t   AD1DATA28 __attribute__((section("sfrs"), address(0xBF84B128)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA28bits_t;
extern volatile __AD1DATA28bits_t AD1DATA28bits __asm__ ("AD1DATA28") __attribute__((section("sfrs"), address(0xBF84B128)));
#define AD1DATA29 AD1DATA29
extern volatile uint32_t   AD1DATA29 __attribute__((section("sfrs"), address(0xBF84B12C)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA29bits_t;
extern volatile __AD1DATA29bits_t AD1DATA29bits __asm__ ("AD1DATA29") __attribute__((section("sfrs"), address(0xBF84B12C)));
#define AD1DATA30 AD1DATA30
extern volatile uint32_t   AD1DATA30 __attribute__((section("sfrs"), address(0xBF84B130)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA30bits_t;
extern volatile __AD1DATA30bits_t AD1DATA30bits __asm__ ("AD1DATA30") __attribute__((section("sfrs"), address(0xBF84B130)));
#define AD1DATA31 AD1DATA31
extern volatile uint32_t   AD1DATA31 __attribute__((section("sfrs"), address(0xBF84B134)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA31bits_t;
extern volatile __AD1DATA31bits_t AD1DATA31bits __asm__ ("AD1DATA31") __attribute__((section("sfrs"), address(0xBF84B134)));
#define AD1DATA32 AD1DATA32
extern volatile uint32_t   AD1DATA32 __attribute__((section("sfrs"), address(0xBF84B138)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA32bits_t;
extern volatile __AD1DATA32bits_t AD1DATA32bits __asm__ ("AD1DATA32") __attribute__((section("sfrs"), address(0xBF84B138)));
#define AD1DATA33 AD1DATA33
extern volatile uint32_t   AD1DATA33 __attribute__((section("sfrs"), address(0xBF84B13C)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA33bits_t;
extern volatile __AD1DATA33bits_t AD1DATA33bits __asm__ ("AD1DATA33") __attribute__((section("sfrs"), address(0xBF84B13C)));
#define AD1DATA34 AD1DATA34
extern volatile uint32_t   AD1DATA34 __attribute__((section("sfrs"), address(0xBF84B140)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA34bits_t;
extern volatile __AD1DATA34bits_t AD1DATA34bits __asm__ ("AD1DATA34") __attribute__((section("sfrs"), address(0xBF84B140)));
#define AD1DATA43 AD1DATA43
extern volatile uint32_t   AD1DATA43 __attribute__((section("sfrs"), address(0xBF84B164)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA43bits_t;
extern volatile __AD1DATA43bits_t AD1DATA43bits __asm__ ("AD1DATA43") __attribute__((section("sfrs"), address(0xBF84B164)));
#define AD1DATA44 AD1DATA44
extern volatile uint32_t   AD1DATA44 __attribute__((section("sfrs"), address(0xBF84B168)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA44bits_t;
extern volatile __AD1DATA44bits_t AD1DATA44bits __asm__ ("AD1DATA44") __attribute__((section("sfrs"), address(0xBF84B168)));
#define AD1CAL1 AD1CAL1
extern volatile uint32_t   AD1CAL1 __attribute__((section("sfrs"), address(0xBF84B200)));
typedef struct {
  uint32_t ADCAL:32;
} __AD1CAL1bits_t;
extern volatile __AD1CAL1bits_t AD1CAL1bits __asm__ ("AD1CAL1") __attribute__((section("sfrs"), address(0xBF84B200)));
#define AD1CAL2 AD1CAL2
extern volatile uint32_t   AD1CAL2 __attribute__((section("sfrs"), address(0xBF84B204)));
typedef struct {
  uint32_t ADCAL:32;
} __AD1CAL2bits_t;
extern volatile __AD1CAL2bits_t AD1CAL2bits __asm__ ("AD1CAL2") __attribute__((section("sfrs"), address(0xBF84B204)));
#define AD1CAL3 AD1CAL3
extern volatile uint32_t   AD1CAL3 __attribute__((section("sfrs"), address(0xBF84B208)));
typedef struct {
  uint32_t ADCAL:32;
} __AD1CAL3bits_t;
extern volatile __AD1CAL3bits_t AD1CAL3bits __asm__ ("AD1CAL3") __attribute__((section("sfrs"), address(0xBF84B208)));
#define AD1CAL4 AD1CAL4
extern volatile uint32_t   AD1CAL4 __attribute__((section("sfrs"), address(0xBF84B20C)));
typedef struct {
  uint32_t ADCAL:32;
} __AD1CAL4bits_t;
