MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECH100/mcu.h
extern volatile __C2FIFOCI24bits_t C2FIFOCI24bits __asm__ ("C2FIFOCI24") __attribute__((section("sfrs"), address(0xBF881980)));
extern volatile uint32_t        C2FIFOCI24CLR __attribute__((section("sfrs"),address(0xBF881984)));
extern volatile uint32_t        C2FIFOCI24SET __attribute__((section("sfrs"),address(0xBF881988)));
extern volatile uint32_t        C2FIFOCI24INV __attribute__((section("sfrs"),address(0xBF88198C)));
#define C2FIFOCON25 C2FIFOCON25
extern volatile uint32_t   C2FIFOCON25 __attribute__((section("sfrs"), address(0xBF881990)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON25bits_t;
extern volatile __C2FIFOCON25bits_t C2FIFOCON25bits __asm__ ("C2FIFOCON25") __attribute__((section("sfrs"), address(0xBF881990)));
extern volatile uint32_t        C2FIFOCON25CLR __attribute__((section("sfrs"),address(0xBF881994)));
extern volatile uint32_t        C2FIFOCON25SET __attribute__((section("sfrs"),address(0xBF881998)));
extern volatile uint32_t        C2FIFOCON25INV __attribute__((section("sfrs"),address(0xBF88199C)));
#define C2FIFOINT25 C2FIFOINT25
extern volatile uint32_t   C2FIFOINT25 __attribute__((section("sfrs"), address(0xBF8819A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT25bits_t;
extern volatile __C2FIFOINT25bits_t C2FIFOINT25bits __asm__ ("C2FIFOINT25") __attribute__((section("sfrs"), address(0xBF8819A0)));
extern volatile uint32_t        C2FIFOINT25CLR __attribute__((section("sfrs"),address(0xBF8819A4)));
extern volatile uint32_t        C2FIFOINT25SET __attribute__((section("sfrs"),address(0xBF8819A8)));
extern volatile uint32_t        C2FIFOINT25INV __attribute__((section("sfrs"),address(0xBF8819AC)));
#define C2FIFOUA25 C2FIFOUA25
extern volatile uint32_t   C2FIFOUA25 __attribute__((section("sfrs"), address(0xBF8819B0)));
extern volatile uint32_t        C2FIFOUA25CLR __attribute__((section("sfrs"),address(0xBF8819B4)));
extern volatile uint32_t        C2FIFOUA25SET __attribute__((section("sfrs"),address(0xBF8819B8)));
extern volatile uint32_t        C2FIFOUA25INV __attribute__((section("sfrs"),address(0xBF8819BC)));
#define C2FIFOCI25 C2FIFOCI25
extern volatile uint32_t   C2FIFOCI25 __attribute__((section("sfrs"), address(0xBF8819C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI25bits_t;
extern volatile __C2FIFOCI25bits_t C2FIFOCI25bits __asm__ ("C2FIFOCI25") __attribute__((section("sfrs"), address(0xBF8819C0)));
extern volatile uint32_t        C2FIFOCI25CLR __attribute__((section("sfrs"),address(0xBF8819C4)));
extern volatile uint32_t        C2FIFOCI25SET __attribute__((section("sfrs"),address(0xBF8819C8)));
extern volatile uint32_t        C2FIFOCI25INV __attribute__((section("sfrs"),address(0xBF8819CC)));
#define C2FIFOCON26 C2FIFOCON26
extern volatile uint32_t   C2FIFOCON26 __attribute__((section("sfrs"), address(0xBF8819D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON26bits_t;
extern volatile __C2FIFOCON26bits_t C2FIFOCON26bits __asm__ ("C2FIFOCON26") __attribute__((section("sfrs"), address(0xBF8819D0)));
extern volatile uint32_t        C2FIFOCON26CLR __attribute__((section("sfrs"),address(0xBF8819D4)));
extern volatile uint32_t        C2FIFOCON26SET __attribute__((section("sfrs"),address(0xBF8819D8)));
extern volatile uint32_t        C2FIFOCON26INV __attribute__((section("sfrs"),address(0xBF8819DC)));
#define C2FIFOINT26 C2FIFOINT26
extern volatile uint32_t   C2FIFOINT26 __attribute__((section("sfrs"), address(0xBF8819E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT26bits_t;
extern volatile __C2FIFOINT26bits_t C2FIFOINT26bits __asm__ ("C2FIFOINT26") __attribute__((section("sfrs"), address(0xBF8819E0)));
extern volatile uint32_t        C2FIFOINT26CLR __attribute__((section("sfrs"),address(0xBF8819E4)));
extern volatile uint32_t        C2FIFOINT26SET __attribute__((section("sfrs"),address(0xBF8819E8)));
extern volatile uint32_t        C2FIFOINT26INV __attribute__((section("sfrs"),address(0xBF8819EC)));
#define C2FIFOUA26 C2FIFOUA26
extern volatile uint32_t   C2FIFOUA26 __attribute__((section("sfrs"), address(0xBF8819F0)));
extern volatile uint32_t        C2FIFOUA26CLR __attribute__((section("sfrs"),address(0xBF8819F4)));
extern volatile uint32_t        C2FIFOUA26SET __attribute__((section("sfrs"),address(0xBF8819F8)));
extern volatile uint32_t        C2FIFOUA26INV __attribute__((section("sfrs"),address(0xBF8819FC)));
#define C2FIFOCI26 C2FIFOCI26
extern volatile uint32_t   C2FIFOCI26 __attribute__((section("sfrs"), address(0xBF881A00)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI26bits_t;
extern volatile __C2FIFOCI26bits_t C2FIFOCI26bits __asm__ ("C2FIFOCI26") __attribute__((section("sfrs"), address(0xBF881A00)));
extern volatile uint32_t        C2FIFOCI26CLR __attribute__((section("sfrs"),address(0xBF881A04)));
extern volatile uint32_t        C2FIFOCI26SET __attribute__((section("sfrs"),address(0xBF881A08)));
extern volatile uint32_t        C2FIFOCI26INV __attribute__((section("sfrs"),address(0xBF881A0C)));
#define C2FIFOCON27 C2FIFOCON27
extern volatile uint32_t   C2FIFOCON27 __attribute__((section("sfrs"), address(0xBF881A10)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON27bits_t;
