MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECH100/mcu.h
extern volatile __USBFIFO1bits_t USBFIFO1bits __asm__ ("USBFIFO1") __attribute__((section("sfrs"), address(0xBF8E3024)));
#define USBFIFO2 USBFIFO2
extern volatile uint32_t   USBFIFO2 __attribute__((section("sfrs"), address(0xBF8E3028)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO2bits_t;
extern volatile __USBFIFO2bits_t USBFIFO2bits __asm__ ("USBFIFO2") __attribute__((section("sfrs"), address(0xBF8E3028)));
#define USBFIFO3 USBFIFO3
extern volatile uint32_t   USBFIFO3 __attribute__((section("sfrs"), address(0xBF8E302C)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO3bits_t;
extern volatile __USBFIFO3bits_t USBFIFO3bits __asm__ ("USBFIFO3") __attribute__((section("sfrs"), address(0xBF8E302C)));
#define USBFIFO4 USBFIFO4
extern volatile uint32_t   USBFIFO4 __attribute__((section("sfrs"), address(0xBF8E3030)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO4bits_t;
extern volatile __USBFIFO4bits_t USBFIFO4bits __asm__ ("USBFIFO4") __attribute__((section("sfrs"), address(0xBF8E3030)));
#define USBFIFO5 USBFIFO5
extern volatile uint32_t   USBFIFO5 __attribute__((section("sfrs"), address(0xBF8E3034)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO5bits_t;
extern volatile __USBFIFO5bits_t USBFIFO5bits __asm__ ("USBFIFO5") __attribute__((section("sfrs"), address(0xBF8E3034)));
#define USBFIFO6 USBFIFO6
extern volatile uint32_t   USBFIFO6 __attribute__((section("sfrs"), address(0xBF8E3038)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO6bits_t;
extern volatile __USBFIFO6bits_t USBFIFO6bits __asm__ ("USBFIFO6") __attribute__((section("sfrs"), address(0xBF8E3038)));
#define USBFIFO7 USBFIFO7
extern volatile uint32_t   USBFIFO7 __attribute__((section("sfrs"), address(0xBF8E303C)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO7bits_t;
extern volatile __USBFIFO7bits_t USBFIFO7bits __asm__ ("USBFIFO7") __attribute__((section("sfrs"), address(0xBF8E303C)));
#define USBOTG USBOTG
extern volatile uint32_t   USBOTG __attribute__((section("sfrs"), address(0xBF8E3060)));
typedef struct {
  uint32_t SESSION:1;
  uint32_t HOSTREQ:1;
  uint32_t HOSTMODE:1;
  uint32_t VBUS:2;
  uint32_t LSDEV:1;
  uint32_t FSDEV:1;
  uint32_t BDEV:1;
  uint32_t RXEDMA:1;
  uint32_t TXEDMA:1;
  uint32_t :6;
  uint32_t TXFIFOSZ:4;
  uint32_t TXDPB:1;
  uint32_t :3;
  uint32_t RXFIFOSZ:4;
  uint32_t RXDPB:1;
} __USBOTGbits_t;
extern volatile __USBOTGbits_t USBOTGbits __asm__ ("USBOTG") __attribute__((section("sfrs"), address(0xBF8E3060)));
#define USBFIFOA USBFIFOA
extern volatile uint32_t   USBFIFOA __attribute__((section("sfrs"), address(0xBF8E3064)));
typedef struct {
  uint32_t TXFIFOAD:13;
  uint32_t :3;
  uint32_t RXFIFOAD:13;
} __USBFIFOAbits_t;
extern volatile __USBFIFOAbits_t USBFIFOAbits __asm__ ("USBFIFOA") __attribute__((section("sfrs"), address(0xBF8E3064)));
#define USBHWVER USBHWVER
extern volatile uint32_t   USBHWVER __attribute__((section("sfrs"), address(0xBF8E306C)));
typedef struct {
  uint32_t VERMINOR:10;
  uint32_t VERMAJOR:5;
  uint32_t RC:1;
} __USBHWVERbits_t;
extern volatile __USBHWVERbits_t USBHWVERbits __asm__ ("USBHWVER") __attribute__((section("sfrs"), address(0xBF8E306C)));
#define USBINFO USBINFO
extern volatile uint32_t   USBINFO __attribute__((section("sfrs"), address(0xBF8E3078)));
typedef struct {
  uint32_t TXENDPTS:4;
  uint32_t RXENDPTS:4;
  uint32_t RAMBITS:4;
  uint32_t DMACHANS:4;
  uint32_t WTID:4;
  uint32_t WTCON:4;
  uint32_t VPLEN:8;
} __USBINFObits_t;
extern volatile __USBINFObits_t USBINFObits __asm__ ("USBINFO") __attribute__((section("sfrs"), address(0xBF8E3078)));
#define USBEOFRST USBEOFRST
extern volatile uint32_t   USBEOFRST __attribute__((section("sfrs"), address(0xBF8E307C)));
typedef union {
  struct {
    uint32_t HSEOF:8;
    uint32_t FSEOF:8;
    uint32_t LSEOF:8;
    uint32_t NRST:1;
    uint32_t NRSTX:1;
  };
  struct {
    uint32_t :24;
    uint32_t SOFRST:8;
  };
} __USBEOFRSTbits_t;
extern volatile __USBEOFRSTbits_t USBEOFRSTbits __asm__ ("USBEOFRST") __attribute__((section("sfrs"), address(0xBF8E307C)));
#define USBE0TXA USBE0TXA
extern volatile uint32_t   USBE0TXA __attribute__((section("sfrs"), address(0xBF8E3080)));
typedef struct {
  uint32_t TXFADDR:7;
  uint32_t :9;
  uint32_t TXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t TXHUBPRT:7;
} __USBE0TXAbits_t;
extern volatile __USBE0TXAbits_t USBE0TXAbits __asm__ ("USBE0TXA") __attribute__((section("sfrs"), address(0xBF8E3080)));
#define USBE0RXA USBE0RXA
extern volatile uint32_t   USBE0RXA __attribute__((section("sfrs"), address(0xBF8E3084)));
typedef struct {
  uint32_t :16;
  uint32_t RXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t RXHUBPRT:7;
} __USBE0RXAbits_t;
extern volatile __USBE0RXAbits_t USBE0RXAbits __asm__ ("USBE0RXA") __attribute__((section("sfrs"), address(0xBF8E3084)));
#define USBE1TXA USBE1TXA
extern volatile uint32_t   USBE1TXA __attribute__((section("sfrs"), address(0xBF8E3088)));
typedef struct {
  uint32_t TXFADDR:7;
  uint32_t :9;
  uint32_t TXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t TXHUBPRT:7;
} __USBE1TXAbits_t;
extern volatile __USBE1TXAbits_t USBE1TXAbits __asm__ ("USBE1TXA") __attribute__((section("sfrs"), address(0xBF8E3088)));
#define USBE1RXA USBE1RXA
extern volatile uint32_t   USBE1RXA __attribute__((section("sfrs"), address(0xBF8E308C)));
typedef struct {
  uint32_t RXFADDR:7;
  uint32_t :9;
  uint32_t RXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t RXHUBPRT:7;
} __USBE1RXAbits_t;
extern volatile __USBE1RXAbits_t USBE1RXAbits __asm__ ("USBE1RXA") __attribute__((section("sfrs"), address(0xBF8E308C)));
#define USBE2TXA USBE2TXA
extern volatile uint32_t   USBE2TXA __attribute__((section("sfrs"), address(0xBF8E3090)));
typedef struct {
  uint32_t TXFADDR:7;
  uint32_t :9;
  uint32_t TXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t TXHUBPRT:7;
} __USBE2TXAbits_t;
extern volatile __USBE2TXAbits_t USBE2TXAbits __asm__ ("USBE2TXA") __attribute__((section("sfrs"), address(0xBF8E3090)));
#define USBE2RXA USBE2RXA
extern volatile uint32_t   USBE2RXA __attribute__((section("sfrs"), address(0xBF8E3094)));
typedef struct {
  uint32_t RXFADDR:7;
  uint32_t :9;
  uint32_t RXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t RXHUBPRT:7;
} __USBE2RXAbits_t;
extern volatile __USBE2RXAbits_t USBE2RXAbits __asm__ ("USBE2RXA") __attribute__((section("sfrs"), address(0xBF8E3094)));
#define USBE3TXA USBE3TXA
extern volatile uint32_t   USBE3TXA __attribute__((section("sfrs"), address(0xBF8E3098)));
typedef struct {
  uint32_t TXFADDR:7;
  uint32_t :9;
  uint32_t TXHUBADD:7;
  uint32_t MULTTRAN:1;
  uint32_t TXHUBPRT:7;
} __USBE3TXAbits_t;
